UB.i18nExtend({
  Enter: 'Увійти',
  Password: 'Пароль',
  User: 'Користувач',
  UBAuthTip: "Введіть ім'я користувача, пароль та натисніть 'Увійти'",
  UBAuthHeader: 'Вхід через обліковий запис <br/> {0}',
  UBAuthForgotPassword: 'Забули пароль?',
  UBAuthRegistration: 'Реєстрація',
  UBAuthContinue: 'Продовжити',
  KerberosRemember: 'Запам\'ятати спосіб входу',
  KerberosHeader: 'Вхід через обліковий запис <br/> операційної системи',
  KerberosTip: 'Вхід з правами користувача, що увійшов до операційної системи. Комп\'ютер повинен бути включений в домені',
  Authentication: 'Аутентифікація',

  unknownError: 'Виникла невідома помилка. Зверніться, будь ласка, до адміністратора системи.',
  recordNotExistsOrDontHaveRights: 'Запису не існує або у Вас відсутні права доступу',
  msgInvalidCertAuth: "В доступі відмовлено. Некоректний сертифікат, закритий ключ або ім'я користувача.",
  msgInvalidUBAuth: "В доступі відмовлено. Перевірте ім'я користувача та пароль.",
  ubErrElsInvalidUserOrPwd: "В доступі відмовлено. Перевірте ім'я користувача та пароль",

  'Access deny': 'У Вас відсутні права на виконання цієї операції',
  ERR_REFERENCE_ERROR: 'Неможливо виконати операцію - елемент використовується іншими сутностями',
  VALUE_MUST_BE_UNIQUE: 'Порушена унікальність - вказане значення вже використовується іншими записами',

})
